About Concurrency

如果没有**阻塞**，那么在单处理器机器上并发就没有任何意义。**但阻塞如果出现在顺序执行的，会导致整个程序阻塞**，而并发不会。

* Erlang是函数式语言，专门针对并发。
* 协作多线程
* 基于消息机制的架构

使用线程是一种建立透明的、可扩展程序的方法。
**后台线程**的`finally`子句不保证一定会执行，当所有主线程退出，所有后台线程会立即停止。
捕获异常的方式：可以为每个线程指定一个异常处理器，用于处理未捕获的异常，类似：
```
Thread.uncaughtException
Thread.setDefaultUncaughtException
```

当要执行`synchronized`保护的代码时，先检查**锁**是否可用，然后获取锁，执行代码。使用`synchronized`，当失败时抛出异常，而显式的锁可以用来作些清理工作。

当类中只有一个可变域时可以使用一个`volatile`，否则使用`synchronized`。

当临界区(同步块)中的锁是**不同对象**时，可以多个方同时运行,如果使用同一个锁`this`，则只能有一个方法运行。

同步只是对象的不完全锁，如果其他线程不需要对此对象同步，他们可以使用该同步对象的。
>它只能防止**对同一对象同步**的其它线程使用共享资源。





